# HR ERD

In [1]:
import pymysql
pymysql.install_as_MySQLdb()

import pandas as pd
from sqlalchemy import create_engine

In [2]:
## INSTRUCTOR CODE FOR CONNECTION
import json
with open('/Users/Lovei/.secret/mysql.json') as f:
    creds = json.load(f)
print(creds.keys())
# Creating the connection url with values stored in json file
connection_str  = f"mysql+pymysql://{creds['username']}:{creds['password']}@localhost/hr"
engine = create_engine(connection_str)
conn = engine.connect()

dict_keys(['username', 'password'])

In [3]:
q = """SHOW TABLES;"""
pd.read_sql(q, conn)

  Tables_in_hr
0   department
1     employee
2          job
3  job_history

In [4]:
q= '''SELECT * FROM employee'''
pd.read_sql(q, conn)

Empty DataFrame
Columns: [EMP_ID, F_NAME, L_NAME, SSN, B_DATE, SEX, ADDRESS, JOB_ID, SALARY, MANAGER_ID, DEP_ID, created_at, updated_at]
Index: []

In [5]:
# Read in the employee data and preview
employees = pd.read_csv('Data/Raw/Employee-data.csv')
employees.info()
employees.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   employee_id  8 non-null      object
 1   f_name       8 non-null      object
 2   l_name       8 non-null      object
 3   ssn          8 non-null      int64
 4   birth_date   8 non-null      object
 5   sex          8 non-null      object
 6   address      8 non-null      object
 7   job_id       8 non-null      int64
 8   salary       8 non-null      int64
 9   manager_id   8 non-null      int64
 10  dep_id       8 non-null      int64
dtypes: int64(5), object(6)
memory usage: 832.0+ bytes

,employee_id,f_name,l_name,ssn,birth_date,sex,address,job_id,salary,manager_id,dep_id
0,E1001,John,Thomas,123456,01/09/1976,M,"5631 Rice, OakPark,IL",100,100000,30001,2
1,E1002,Alice,James,123457,07/31/1972,F,"980 Berry ln, Elgin,IL",200,80000,30002,5
2,E1003,Steve,Wells,123458,08/10/1980,M,"291 Springs, Gary,IL",300,50000,30002,5
3,E1004,Santosh,Kumar,123459,07/20/1985,M,"511 Aurora Av, Aurora,IL",400,60000,30004,5
4,E1005,Ahmed,Hussain,123410,01/04/1981,M,"216 Oak Tree, Geneva,IL",500,70000,30001,2

In [6]:
q = '''DESCRIBE employee;'''
describe = pd.read_sql(q, conn)
describe

,Field,Type,Null,Key,Default,Extra
0,EMP_ID,varchar(9),NO,PRI,None,
1,F_NAME,varchar(45),YES,,None,
2,L_NAME,varchar(45),YES,,None,
3,SSN,char(9),YES,,None,
4,B_DATE,date,YES,,None,
5,SEX,char(1),YES,,None,
6,ADDRESS,varchar(45),YES,,None,
7,JOB_ID,char(9),NO,MUL,None,
8,SALARY,"decimal(10,2)",YES,,None,
9,MANAGER_ID,char(9),YES,,None,
10,DEP_ID,char(9),YES,MUL,None,
11,created_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
12,updated_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP

In [7]:
# Checking describe's Field names
describe['Field'].values

array(['EMP_ID', 'F_NAME', 'L_NAME', 'SSN', 'B_DATE', 'SEX', 'ADDRESS',
       'JOB_ID', 'SALARY', 'MANAGER_ID', 'DEP_ID', 'created_at',
       'updated_at'], dtype=object)

In [8]:
# Checking dataframe's columns
employees.columns

Index(['employee_id', 'f_name', 'l_name', 'ssn', 'birth_date', 'sex',
       'address', 'job_id', 'salary', 'manager_id', 'dep_id'],
      dtype='object')

In [9]:
# convert the column names to uppercase using .str.upper()
employees.columns.str.upper()

Index(['EMPLOYEE_ID', 'F_NAME', 'L_NAME', 'SSN', 'BIRTH_DATE', 'SEX',
       'ADDRESS', 'JOB_ID', 'SALARY', 'MANAGER_ID', 'DEP_ID'],
      dtype='object')

In [10]:
# replace original column names
employees.columns = employees.columns.str.upper()
employees.head(2)

,EMPLOYEE_ID,F_NAME,L_NAME,SSN,BIRTH_DATE,SEX,ADDRESS,JOB_ID,SALARY,MANAGER_ID,DEP_ID
0,E1001,John,Thomas,123456,01/09/1976,M,"5631 Rice, OakPark,IL",100,100000,30001,2
1,E1002,Alice,James,123457,07/31/1972,F,"980 Berry ln, Elgin,IL",200,80000,30002,5

In [11]:
# Rename columns to match SQL table
rename_map = {"EMPLOYEE_ID":"EMP_ID",
             "BIRTH_DATE":"B_DATE"}
employees = employees.rename(rename_map,axis=1)
employees.head(2)

,EMP_ID,F_NAME,L_NAME,SSN,B_DATE,SEX,ADDRESS,JOB_ID,SALARY,MANAGER_ID,DEP_ID
0,E1001,John,Thomas,123456,01/09/1976,M,"5631 Rice, OakPark,IL",100,100000,30001,2
1,E1002,Alice,James,123457,07/31/1972,F,"980 Berry ln, Elgin,IL",200,80000,30002,5

In [12]:
# Reviewing SQL table's data types
describe[['Field','Type']]

         Field           Type
0       EMP_ID     varchar(9)
1       F_NAME    varchar(45)
2       L_NAME    varchar(45)
3          SSN        char(9)
4       B_DATE           date
5          SEX        char(1)
6      ADDRESS    varchar(45)
7       JOB_ID        char(9)
8       SALARY  decimal(10,2)
9   MANAGER_ID        char(9)
10      DEP_ID        char(9)
11  created_at       datetime
12  updated_at       datetime

In [13]:
# Reviewing dataframe's data types
employees.dtypes

EMP_ID        object
F_NAME        object
L_NAME        object
SSN            int64
B_DATE        object
SEX           object
ADDRESS       object
JOB_ID         int64
SALARY         int64
MANAGER_ID     int64
DEP_ID         int64
dtype: object

In [14]:
# Converting B_DATE to datetime dtype
employees['B_DATE'] = pd.to_datetime(employees['B_DATE'])
employees.dtypes

EMP_ID                object
F_NAME                object
L_NAME                object
SSN                    int64
B_DATE        datetime64[ns]
SEX                   object
ADDRESS               object
JOB_ID                 int64
SALARY                 int64
MANAGER_ID             int64
DEP_ID                 int64
dtype: object

In [23]:
# Checking the setting for FOREIGN_KEY_CHECKS
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q, conn)

   @@FOREIGN_KEY_CHECKS
0                     1

In [25]:
# Changing the setting for FOREIGN_KEY_CHECKS with the connection
q = """SET @@FOREIGN_KEY_CHECKS=0"""
conn.execute(q)

In [26]:
# Confirm the checks are deactiavated
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q,conn)

   @@FOREIGN_KEY_CHECKS
0                     0

In [27]:
# Inserting the data now that foreign key checks are disabled
employees.to_sql("employee",conn,index=False, if_exists='append')

8

In [28]:
# confirm the data has been added
q = """SELECT * FROM employee;"""
pd.read_sql(q,conn)

,EMP_ID,F_NAME,L_NAME,SSN,B_DATE,SEX,ADDRESS,JOB_ID,SALARY,MANAGER_ID,DEP_ID,created_at,updated_at
0,E1001,John,Thomas,123456,1976-01-09,M,"5631 Rice, OakPark,IL",100,100000.0,30001,2,2023-10-25 21:56:08,2023-10-25 21:56:08
1,E1002,Alice,James,123457,1972-07-31,F,"980 Berry ln, Elgin,IL",200,80000.0,30002,5,2023-10-25 21:56:08,2023-10-25 21:56:08
2,E1003,Steve,Wells,123458,1980-08-10,M,"291 Springs, Gary,IL",300,50000.0,30002,5,2023-10-25 21:56:08,2023-10-25 21:56:08
3,E1004,Santosh,Kumar,123459,1985-07-20,M,"511 Aurora Av, Aurora,IL",400,60000.0,30004,5,2023-10-25 21:56:08,2023-10-25 21:56:08
4,E1005,Ahmed,Hussain,123410,1981-01-04,M,"216 Oak Tree, Geneva,IL",500,70000.0,30001,2,2023-10-25 21:56:08,2023-10-25 21:56:08
5,E1006,Nancy,Allen,123411,1978-02-06,F,"111 Green Pl, Elgin,IL",600,90000.0,30001,2,2023-10-25 21:56:08,2023-10-25 21:56:08
6,E1007,Mary,Thomas,123412,1975-05-05,F,"100 Rose Pl, Gary,IL",650,65000.0,30003,7,2023-10-25 21:56:08,2023-10-25 21:56:08
7,E1008,Bharath,Gupta,123413,1985-05-06,M,"145 Berry Ln, Naperville,IL",660,65000.0,30003,7,2023-10-25 21:56:08,2023-10-25 21:56:08

In [29]:
# check the describe again to confirm no changes
q = """DESCRIBE employee;"""
pd.read_sql(q,conn)

,Field,Type,Null,Key,Default,Extra
0,EMP_ID,varchar(9),NO,PRI,None,
1,F_NAME,varchar(45),YES,,None,
2,L_NAME,varchar(45),YES,,None,
3,SSN,char(9),YES,,None,
4,B_DATE,date,YES,,None,
5,SEX,char(1),YES,,None,
6,ADDRESS,varchar(45),YES,,None,
7,JOB_ID,char(9),NO,MUL,None,
8,SALARY,"decimal(10,2)",YES,,None,
9,MANAGER_ID,char(9),YES,,None,
10,DEP_ID,char(9),YES,MUL,None,
11,created_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
12,updated_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP

In [31]:
# Loading new file and repeating preprocessing/cleaning steps
employees = pd.read_csv("Data/Raw/Employee-data-v2.csv")
# replace original column names
employees.columns = employees.columns.str.upper()
# Rename EMPLOYEE_ID to "EMP_ID"
rename_map = {"EMPLOYEE_ID":"EMP_ID",
             "BIRTH_DATE":"B_DATE"}
employees = employees.rename(rename_map, axis=1)
# Changing B_DATE to datetime dtype
employees['B_DATE'] = pd.to_datetime(employees['B_DATE'])
employees

,EMP_ID,F_NAME,L_NAME,SSN,B_DATE,SEX,ADDRESS,JOB_ID,SALARY,MANAGER_ID,DEP_ID
0,E1001,John,Thomas,123456,1976-01-09,M,"5631 Rice, OakPark,IL",100,100000,30001,2
1,E1002,Alice,James,123457,1972-07-31,F,"980 Berry ln, Elgin,IL",200,80000,30002,5
2,E1003,Steve,Wells,123458,1980-08-10,M,"291 Springs, Gary,IL",300,50000,30002,5
3,E1004,Santosh,Kumar,123459,1985-07-20,M,"511 Aurora Av, Aurora,IL",400,60000,30004,5
4,E1005,Ahmed,Hussain,123410,1981-01-04,M,"216 Oak Tree, Geneva,IL",500,70000,30001,2
5,E1006,Nancy,Allen,123411,1978-02-06,F,"111 Green Pl, Elgin,IL",600,90000,30001,2
6,E1007,Mary,Thomas,123412,1975-05-05,F,"100 Rose Pl, Gary,IL",650,65000,30003,7
7,E1008,Bharath,Gupta,123413,1985-05-06,M,"145 Berry Ln, Naperville,IL",660,65000,30003,7
8,E1009,Andrea,Jones,123414,1990-07-09,F,"120 Fall Creek, Gary,IL",234,70000,30003,7
9,E1010,Ann,Jacob,123415,1982-03-30,F,"111 Britany Springs,Elgin,IL",220,70000,30004,5

In [32]:
# Confirming no new rows have been added
q = """SELECT * FROM employee"""
pd.read_sql(q, conn)

,EMP_ID,F_NAME,L_NAME,SSN,B_DATE,SEX,ADDRESS,JOB_ID,SALARY,MANAGER_ID,DEP_ID,created_at,updated_at
0,E1001,John,Thomas,123456,1976-01-09,M,"5631 Rice, OakPark,IL",100,100000.0,30001,2,2023-10-25 21:56:08,2023-10-25 21:56:08
1,E1002,Alice,James,123457,1972-07-31,F,"980 Berry ln, Elgin,IL",200,80000.0,30002,5,2023-10-25 21:56:08,2023-10-25 21:56:08
2,E1003,Steve,Wells,123458,1980-08-10,M,"291 Springs, Gary,IL",300,50000.0,30002,5,2023-10-25 21:56:08,2023-10-25 21:56:08
3,E1004,Santosh,Kumar,123459,1985-07-20,M,"511 Aurora Av, Aurora,IL",400,60000.0,30004,5,2023-10-25 21:56:08,2023-10-25 21:56:08
4,E1005,Ahmed,Hussain,123410,1981-01-04,M,"216 Oak Tree, Geneva,IL",500,70000.0,30001,2,2023-10-25 21:56:08,2023-10-25 21:56:08
5,E1006,Nancy,Allen,123411,1978-02-06,F,"111 Green Pl, Elgin,IL",600,90000.0,30001,2,2023-10-25 21:56:08,2023-10-25 21:56:08
6,E1007,Mary,Thomas,123412,1975-05-05,F,"100 Rose Pl, Gary,IL",650,65000.0,30003,7,2023-10-25 21:56:08,2023-10-25 21:56:08
7,E1008,Bharath,Gupta,123413,1985-05-06,M,"145 Berry Ln, Naperville,IL",660,65000.0,30003,7,2023-10-25 21:56:08,2023-10-25 21:56:08

In [33]:
# Checking the data types before inserting new data
q = """DESCRIBE employee;"""
pd.read_sql(q,conn)

,Field,Type,Null,Key,Default,Extra
0,EMP_ID,varchar(9),NO,PRI,None,
1,F_NAME,varchar(45),YES,,None,
2,L_NAME,varchar(45),YES,,None,
3,SSN,char(9),YES,,None,
4,B_DATE,date,YES,,None,
5,SEX,char(1),YES,,None,
6,ADDRESS,varchar(45),YES,,None,
7,JOB_ID,char(9),NO,MUL,None,
8,SALARY,"decimal(10,2)",YES,,None,
9,MANAGER_ID,char(9),YES,,None,
10,DEP_ID,char(9),YES,MUL,None,
11,created_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
12,updated_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP

In [34]:
from sqlalchemy.types import VARCHAR, CHAR, DECIMAL, DATE, DATETIME

In [35]:
employee_dtypes  = {'EMP_ID':VARCHAR(9),
                    'F_NAME':VARCHAR(45),
                    'L_NAME':VARCHAR(45),
                    'SSN': CHAR(9),
                    'B_DATE':DATE,
                    'SEX':CHAR(1),
                    'ADDRESS':VARCHAR(45),
                    'JOB_ID':CHAR(9),
                    'SALARY':DECIMAL(10,2),
                    'MANAGER_ID':CHAR(9),
                    'DEP_ID':CHAR(9),
                    'created_at':DATETIME,
                    'updated_at':DATETIME}
employee_dtypes

{'EMP_ID': VARCHAR(length=9),
 'F_NAME': VARCHAR(length=45),
 'L_NAME': VARCHAR(length=45),
 'SSN': CHAR(length=9),
 'B_DATE': sqlalchemy.sql.sqltypes.DATE,
 'SEX': CHAR(length=1),
 'ADDRESS': VARCHAR(length=45),
 'JOB_ID': CHAR(length=9),
 'SALARY': DECIMAL(precision=10, scale=2),
 'MANAGER_ID': CHAR(length=9),
 'DEP_ID': CHAR(length=9),
 'created_at': sqlalchemy.sql.sqltypes.DATETIME,
 'updated_at': sqlalchemy.sql.sqltypes.DATETIME}

In [36]:
# Changing if_exists to replace to demo consequences.
employees.to_sql("employee",conn, index=False, if_exists='replace',
                dtype=employee_dtypes)
# Checking the describe again
q = """DESCRIBE employee;"""
pd.read_sql(q,conn)

         Field           Type Null Key Default Extra
0       EMP_ID     varchar(9)  YES        None
1       F_NAME    varchar(45)  YES        None
2       L_NAME    varchar(45)  YES        None
3          SSN        char(9)  YES        None
4       B_DATE           date  YES        None
5          SEX        char(1)  YES        None
6      ADDRESS    varchar(45)  YES        None
7       JOB_ID        char(9)  YES        None
8       SALARY  decimal(10,2)  YES        None
9   MANAGER_ID        char(9)  YES        None
10      DEP_ID        char(9)  YES        None

In [37]:
q = """ALTER TABLE employee ADD created_at DATETIME DEFAULT NOW()"""
conn.execute(q)

In [38]:
q = """ALTER TABLE employee ADD updated_at DATETIME DEFAULT NOW() ON UPDATE NOW();"""
conn.execute(q)

In [39]:
q = """SELECT * FROM employee;"""
pd.read_sql(q,conn)

,EMP_ID,F_NAME,L_NAME,SSN,B_DATE,SEX,ADDRESS,JOB_ID,SALARY,MANAGER_ID,DEP_ID,created_at,updated_at
0,E1001,John,Thomas,123456,1976-01-09,M,"5631 Rice, OakPark,IL",100,100000.0,30001,2,2023-10-25 22:12:17,2023-10-25 22:12:25
1,E1002,Alice,James,123457,1972-07-31,F,"980 Berry ln, Elgin,IL",200,80000.0,30002,5,2023-10-25 22:12:17,2023-10-25 22:12:25
2,E1003,Steve,Wells,123458,1980-08-10,M,"291 Springs, Gary,IL",300,50000.0,30002,5,2023-10-25 22:12:17,2023-10-25 22:12:25
3,E1004,Santosh,Kumar,123459,1985-07-20,M,"511 Aurora Av, Aurora,IL",400,60000.0,30004,5,2023-10-25 22:12:17,2023-10-25 22:12:25
4,E1005,Ahmed,Hussain,123410,1981-01-04,M,"216 Oak Tree, Geneva,IL",500,70000.0,30001,2,2023-10-25 22:12:17,2023-10-25 22:12:25
5,E1006,Nancy,Allen,123411,1978-02-06,F,"111 Green Pl, Elgin,IL",600,90000.0,30001,2,2023-10-25 22:12:17,2023-10-25 22:12:25
6,E1007,Mary,Thomas,123412,1975-05-05,F,"100 Rose Pl, Gary,IL",650,65000.0,30003,7,2023-10-25 22:12:17,2023-10-25 22:12:25
7,E1008,Bharath,Gupta,123413,1985-05-06,M,"145 Berry Ln, Naperville,IL",660,65000.0,30003,7,2023-10-25 22:12:17,2023-10-25 22:12:25
8,E1009,Andrea,Jones,123414,1990-07-09,F,"120 Fall Creek, Gary,IL",234,70000.0,30003,7,2023-10-25 22:12:17,2023-10-25 22:12:25
9,E1010,Ann,Jacob,123415,1982-03-30,F,"111 Britany Springs,Elgin,IL",220,70000.0,30004,5,2023-10-25 22:12:17,2023-10-25 22:12:25

In [40]:
# Closing the connection
conn.close()